Revit 2024 API
CircuitSequence Enumeration
 Options of circuit sequence for assigning circuit to circuits across panel.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015 Subscription Update
Syntax
C#
public enum CircuitSequence
Visual Basic
Public Enumeration CircuitSequence
Visual C++
public enum class CircuitSequence
Members
Member name | Description
Numerical |  Create new circuits numerically (1,2,3,4,5,6,7,8,9,10,11,12).
GroupByPhase |  Create new circuits group by phase (1,3,5 / 2,4,6 / 7,9,11 / 8,10,12).
OddThenEven |  Create new circuits odd then even (1,3,5,7,9,11 / 2,4,6,8,10,12).
See Also
Autodesk.Revit.DB.Electrical Namespace